TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_comp.h
/******************************************************************************
* COMP Register Control Bits
******************************************************************************/

/* COMP_IIDX Bits */
/* COMP_IIDX[STAT] Bits */
#define COMP_IIDX_STAT_OFS                       (0)                             /* !< STAT Offset */
#define COMP_IIDX_STAT_MASK                      ((uint32_t)0x00000003U)         /* !< Interrupt index status */
#define COMP_IIDX_STAT_NO_INTR                   ((uint32_t)0x00000000U)         /* !< No pending interrupt */
#define COMP_IIDX_STAT_COMPIFG                   ((uint32_t)0x00000002U)         /* !< Comparator output interrupt */
#define COMP_IIDX_STAT_COMPINVIFG                ((uint32_t)0x00000003U)         /* !< Comparator output inverted
                                                                                    interrupt */
#define COMP_IIDX_STAT_OUTRDYIFG                 ((uint32_t)0x00000004U)         /* !< Comparator output ready interrupt */

/* COMP_IMASK Bits */
/* COMP_IMASK[COMPIFG] Bits */
#define COMP_IMASK_COMPIFG_OFS                   (1)                             /* !< COMPIFG Offset */
#define COMP_IMASK_COMPIFG_MASK                  ((uint32_t)0x00000002U)         /* !< Masks COMPIFG */
#define COMP_IMASK_COMPIFG_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define COMP_IMASK_COMPIFG_SET                   ((uint32_t)0x00000002U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */
/* COMP_IMASK[COMPINVIFG] Bits */
#define COMP_IMASK_COMPINVIFG_OFS                (2)                             /* !< COMPINVIFG Offset */
#define COMP_IMASK_COMPINVIFG_MASK               ((uint32_t)0x00000004U)         /* !< Masks COMPINVIFG */
#define COMP_IMASK_COMPINVIFG_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define COMP_IMASK_COMPINVIFG_SET                ((uint32_t)0x00000004U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */
/* COMP_IMASK[OUTRDYIFG] Bits */
#define COMP_IMASK_OUTRDYIFG_OFS                 (3)                             /* !< OUTRDYIFG Offset */
#define COMP_IMASK_OUTRDYIFG_MASK                ((uint32_t)0x00000008U)         /* !< Masks OUTRDYIFG */
#define COMP_IMASK_OUTRDYIFG_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define COMP_IMASK_OUTRDYIFG_SET                 ((uint32_t)0x00000008U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */

/* COMP_RIS Bits */
/* COMP_RIS[COMPIFG] Bits */
#define COMP_RIS_COMPIFG_OFS                     (1)                             /* !< COMPIFG Offset */
#define COMP_RIS_COMPIFG_MASK                    ((uint32_t)0x00000002U)         /* !< Raw interrupt status for comparator
                                                                                    output interrupt flag. The IES bit
                                                                                    defines the transition of the
                                                                                    comparator output setting this bit. */
#define COMP_RIS_COMPIFG_CLR                     ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define COMP_RIS_COMPIFG_SET                     ((uint32_t)0x00000002U)         /* !< Interrupt pending */
/* COMP_RIS[COMPINVIFG] Bits */
#define COMP_RIS_COMPINVIFG_OFS                  (2)                             /* !< COMPINVIFG Offset */
#define COMP_RIS_COMPINVIFG_MASK                 ((uint32_t)0x00000004U)         /* !< Raw interrupt status for comparator
                                                                                    output inverted interrupt flag. The
                                                                                    IES bit defines the transition of the
                                                                                    comparator output setting this bit. */
#define COMP_RIS_COMPINVIFG_CLR                  ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define COMP_RIS_COMPINVIFG_SET                  ((uint32_t)0x00000004U)         /* !< Interrupt pending */
/* COMP_RIS[OUTRDYIFG] Bits */
#define COMP_RIS_OUTRDYIFG_OFS                   (3)                             /* !< OUTRDYIFG Offset */
#define COMP_RIS_OUTRDYIFG_MASK                  ((uint32_t)0x00000008U)         /* !< Raw interrupt status for comparator
                                                                                    output ready interrupt flag. This bit
                                                                                    is set when the comparator output is
                                                                                    valid. */
#define COMP_RIS_OUTRDYIFG_CLR                   ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define COMP_RIS_OUTRDYIFG_SET                   ((uint32_t)0x00000008U)         /* !< Interrupt pending */

/* COMP_MIS Bits */
/* COMP_MIS[COMPIFG] Bits */
#define COMP_MIS_COMPIFG_OFS                     (1)                             /* !< COMPIFG Offset */
#define COMP_MIS_COMPIFG_MASK                    ((uint32_t)0x00000002U)         /* !< Masked interrupt status for COMPIFG */
#define COMP_MIS_COMPIFG_CLR                     ((uint32_t)0x00000000U)         /* !< COMPIFG does not request an
                                                                                    interrupt service routine */
#define COMP_MIS_COMPIFG_SET                     ((uint32_t)0x00000002U)         /* !< COMPIFG requests an interrupt
                                                                                    service routine */
/* COMP_MIS[COMPINVIFG] Bits */
#define COMP_MIS_COMPINVIFG_OFS                  (2)                             /* !< COMPINVIFG Offset */
#define COMP_MIS_COMPINVIFG_MASK                 ((uint32_t)0x00000004U)         /* !< Masked interrupt status for
                                                                                    COMPINVIFG */
#define COMP_MIS_COMPINVIFG_CLR                  ((uint32_t)0x00000000U)         /* !< COMPINVIFG does not request an
                                                                                    interrupt service routine */
#define COMP_MIS_COMPINVIFG_SET                  ((uint32_t)0x00000004U)         /* !< COMPINVIFG requests an interrupt
                                                                                    service routine */
/* COMP_MIS[OUTRDYIFG] Bits */
#define COMP_MIS_OUTRDYIFG_OFS                   (3)                             /* !< OUTRDYIFG Offset */
#define COMP_MIS_OUTRDYIFG_MASK                  ((uint32_t)0x00000008U)         /* !< Masked interrupt status for
                                                                                    OUTRDYIFG */
#define COMP_MIS_OUTRDYIFG_CLR                   ((uint32_t)0x00000000U)         /* !< OUTRDYIFG does not request an
                                                                                    interrupt service routine */
#define COMP_MIS_OUTRDYIFG_SET                   ((uint32_t)0x00000008U)         /* !< OUTRDYIFG requests an interrupt
                                                                                    service routine */

/* COMP_ISET Bits */
/* COMP_ISET[COMPIFG] Bits */
#define COMP_ISET_COMPIFG_OFS                    (1)                             /* !< COMPIFG Offset */
#define COMP_ISET_COMPIFG_MASK                   ((uint32_t)0x00000002U)         /* !< Sets COMPIFG in RIS register */
#define COMP_ISET_COMPIFG_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define COMP_ISET_COMPIFG_SET                    ((uint32_t)0x00000002U)         /* !< RIS bit corresponding to COMPIFG is
                                                                                    set */
/* COMP_ISET[COMPINVIFG] Bits */
#define COMP_ISET_COMPINVIFG_OFS                 (2)                             /* !< COMPINVIFG Offset */
#define COMP_ISET_COMPINVIFG_MASK                ((uint32_t)0x00000004U)         /* !< Sets COMPINVIFG in RIS register */
#define COMP_ISET_COMPINVIFG_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define COMP_ISET_COMPINVIFG_SET                 ((uint32_t)0x00000004U)         /* !< RIS bit corresponding to COMPINVIFG
                                                                                    is set */
/* COMP_ISET[OUTRDYIFG] Bits */
#define COMP_ISET_OUTRDYIFG_OFS                  (3)                             /* !< OUTRDYIFG Offset */
#define COMP_ISET_OUTRDYIFG_MASK                 ((uint32_t)0x00000008U)         /* !< Sets OUTRDYIFG in RIS register */
#define COMP_ISET_OUTRDYIFG_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define COMP_ISET_OUTRDYIFG_SET                  ((uint32_t)0x00000008U)         /* !< RIS bit corresponding to OUTRDYIFG
                                                                                    is set */

/* COMP_ICLR Bits */
/* COMP_ICLR[COMPIFG] Bits */
#define COMP_ICLR_COMPIFG_OFS                    (1)                             /* !< COMPIFG Offset */
#define COMP_ICLR_COMPIFG_MASK                   ((uint32_t)0x00000002U)         /* !< Clears COMPIFG in RIS register */
#define COMP_ICLR_COMPIFG_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define COMP_ICLR_COMPIFG_CLR                    ((uint32_t)0x00000002U)         /* !< RIS bit corresponding to COMPIFG is
                                                                                    cleared */
/* COMP_ICLR[COMPINVIFG] Bits */
#define COMP_ICLR_COMPINVIFG_OFS                 (2)                             /* !< COMPINVIFG Offset */
#define COMP_ICLR_COMPINVIFG_MASK                ((uint32_t)0x00000004U)         /* !< Clears COMPINVIFG in RIS register */
#define COMP_ICLR_COMPINVIFG_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define COMP_ICLR_COMPINVIFG_CLR                 ((uint32_t)0x00000004U)         /* !< RIS bit corresponding to COMPINVIFG
                                                                                    is cleared */
/* COMP_ICLR[OUTRDYIFG] Bits */
#define COMP_ICLR_OUTRDYIFG_OFS                  (3)                             /* !< OUTRDYIFG Offset */
#define COMP_ICLR_OUTRDYIFG_MASK                 ((uint32_t)0x00000008U)         /* !< Clears OUTRDYIFG in RIS register */
#define COMP_ICLR_OUTRDYIFG_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define COMP_ICLR_OUTRDYIFG_CLR                  ((uint32_t)0x00000008U)         /* !< RIS bit corresponding to OUTRDYIFG
                                                                                    is cleared */

/* COMP_PWREN Bits */
/* COMP_PWREN[ENABLE] Bits */
#define COMP_PWREN_ENABLE_OFS                    (0)                             /* !< ENABLE Offset */
#define COMP_PWREN_ENABLE_MASK                   ((uint32_t)0x00000001U)         /* !< Enable the power */
#define COMP_PWREN_ENABLE_DISABLE                ((uint32_t)0x00000000U)         /* !< Disable Power */
#define COMP_PWREN_ENABLE_ENABLE                 ((uint32_t)0x00000001U)         /* !< Enable Power */
/* COMP_PWREN[KEY] Bits */
#define COMP_PWREN_KEY_OFS                       (24)                            /* !< KEY Offset */
#define COMP_PWREN_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define COMP_PWREN_KEY_UNLOCK_W                  ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

