TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_comp.h
/* COMP_DESC Bits */
/* COMP_DESC[MINREV] Bits */
#define COMP_DESC_MINREV_OFS                     (0)                             /* !< MINREV Offset */
#define COMP_DESC_MINREV_MASK                    ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
/* COMP_DESC[MAJREV] Bits */
#define COMP_DESC_MAJREV_OFS                     (4)                             /* !< MAJREV Offset */
#define COMP_DESC_MAJREV_MASK                    ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
/* COMP_DESC[FEATUREVER] Bits */
#define COMP_DESC_FEATUREVER_OFS                 (12)                            /* !< FEATUREVER Offset */
#define COMP_DESC_FEATUREVER_MASK                ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
/* COMP_DESC[MODULEID] Bits */
#define COMP_DESC_MODULEID_OFS                   (16)                            /* !< MODULEID Offset */
#define COMP_DESC_MODULEID_MASK                  ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */

/* COMP_CTL0 Bits */
/* COMP_CTL0[IPSEL] Bits */
#define COMP_CTL0_IPSEL_OFS                      (0)                             /* !< IPSEL Offset */
#define COMP_CTL0_IPSEL_MASK                     ((uint32_t)0x00000007U)         /* !< Channel input selected for the
                                                                                    positive terminal of the comparator
                                                                                    if IPEN is set to 1. */
#define COMP_CTL0_IPSEL_CH_0                     ((uint32_t)0x00000000U)         /* !< Channel 0 selected */
#define COMP_CTL0_IPSEL_CH_1                     ((uint32_t)0x00000001U)         /* !< Channel 1 selected */
#define COMP_CTL0_IPSEL_CH_2                     ((uint32_t)0x00000002U)         /* !< Channel 2 selected */
#define COMP_CTL0_IPSEL_CH_3                     ((uint32_t)0x00000003U)         /* !< Channel 3 selected */
#define COMP_CTL0_IPSEL_CH_4                     ((uint32_t)0x00000004U)         /* !< Channel 4 selected */
#define COMP_CTL0_IPSEL_CH_5                     ((uint32_t)0x00000005U)         /* !< Channel 5 selected */
#define COMP_CTL0_IPSEL_CH_6                     ((uint32_t)0x00000006U)         /* !< Channel 6 selected */
#define COMP_CTL0_IPSEL_CH_7                     ((uint32_t)0x00000007U)         /* !< Channel 7  selected */
/* COMP_CTL0[IPEN] Bits */
#define COMP_CTL0_IPEN_OFS                       (15)                            /* !< IPEN Offset */
#define COMP_CTL0_IPEN_MASK                      ((uint32_t)0x00008000U)         /* !< Channel input enable for the
                                                                                    positive terminal of the comparator. */
#define COMP_CTL0_IPEN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Selected analog input channel for
                                                                                    positive terminal is disabled */
#define COMP_CTL0_IPEN_ENABLE                    ((uint32_t)0x00008000U)         /* !< Selected analog input channel for
                                                                                    positive terminal is enabled */
/* COMP_CTL0[IMEN] Bits */
#define COMP_CTL0_IMEN_OFS                       (31)                            /* !< IMEN Offset */
#define COMP_CTL0_IMEN_MASK                      ((uint32_t)0x80000000U)         /* !< Channel input enable for the
                                                                                    negative terminal of the comparator. */
#define COMP_CTL0_IMEN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Selected analog input channel for
                                                                                    negative terminal is disabled */
#define COMP_CTL0_IMEN_ENABLE                    ((uint32_t)0x80000000U)         /* !< Selected analog input channel for
                                                                                    negative terminal is enabled */
/* COMP_CTL0[IMSEL] Bits */
#define COMP_CTL0_IMSEL_OFS                      (16)                            /* !< IMSEL Offset */
#define COMP_CTL0_IMSEL_MASK                     ((uint32_t)0x00070000U)         /* !< Channel input selected for the
                                                                                    negative terminal of the comparator
                                                                                    if IMEN is set to 1. */
#define COMP_CTL0_IMSEL_CH_0                     ((uint32_t)0x00000000U)         /* !< Channel 0 selected */
#define COMP_CTL0_IMSEL_CH_1                     ((uint32_t)0x00010000U)         /* !< Channel 1 selected */
#define COMP_CTL0_IMSEL_CH_2                     ((uint32_t)0x00020000U)         /* !< Channel 2 selected */
#define COMP_CTL0_IMSEL_CH_3                     ((uint32_t)0x00030000U)         /* !< Channel 3 selected */
#define COMP_CTL0_IMSEL_CH_4                     ((uint32_t)0x00040000U)         /* !< Channel 4 selected */
#define COMP_CTL0_IMSEL_CH_5                     ((uint32_t)0x00050000U)         /* !< Channel 5 selected */
#define COMP_CTL0_IMSEL_CH_6                     ((uint32_t)0x00060000U)         /* !< Channel 6 selected */
#define COMP_CTL0_IMSEL_CH_7                     ((uint32_t)0x00070000U)         /* !< Channel 7 selected */

/* COMP_CTL1 Bits */
/* COMP_CTL1[ENABLE] Bits */
#define COMP_CTL1_ENABLE_OFS                     (0)                             /* !< ENABLE Offset */
#define COMP_CTL1_ENABLE_MASK                    ((uint32_t)0x00000001U)         /* !< This bit turns on the comparator.
                                                                                    When the comparator is turned off it
                                                                                    consumes no power. */
#define COMP_CTL1_ENABLE_OFF                     ((uint32_t)0x00000000U)         /* !< Comparator is off */
#define COMP_CTL1_ENABLE_ON                      ((uint32_t)0x00000001U)         /* !< Comparator is on */
/* COMP_CTL1[MODE] Bits */
#define COMP_CTL1_MODE_OFS                       (1)                             /* !< MODE Offset */
#define COMP_CTL1_MODE_MASK                      ((uint32_t)0x00000002U)         /* !< This bit selects the comparator
                                                                                    operating mode. */
#define COMP_CTL1_MODE_FAST                      ((uint32_t)0x00000000U)         /* !< Comparator is in fast mode */
#define COMP_CTL1_MODE_ULP                       ((uint32_t)0x00000002U)         /* !< Comparator is in ultra-low power
                                                                                    mode */
/* COMP_CTL1[EXCH] Bits */
#define COMP_CTL1_EXCH_OFS                       (2)                             /* !< EXCH Offset */
#define COMP_CTL1_EXCH_MASK                      ((uint32_t)0x00000004U)         /* !< This bit exchanges the comparator
                                                                                    inputs and inverts the comparator
                                                                                    output. */
#define COMP_CTL1_EXCH_NO_EXC                    ((uint32_t)0x00000000U)         /* !< Comparator inputs not exchanged and
                                                                                    output not inverted */
#define COMP_CTL1_EXCH_EXC                       ((uint32_t)0x00000004U)         /* !< Comparator inputs exchanged and
                                                                                    output inverted */
/* COMP_CTL1[SHORT] Bits */
#define COMP_CTL1_SHORT_OFS                      (3)                             /* !< SHORT Offset */
#define COMP_CTL1_SHORT_MASK                     ((uint32_t)0x00000008U)         /* !< This bit shorts the positive and
                                                                                    negative input terminals of the
                                                                                    comparator. */
#define COMP_CTL1_SHORT_NO_SHT                   ((uint32_t)0x00000000U)         /* !< Comparator positive and negative
                                                                                    input terminals are not shorted */
#define COMP_CTL1_SHORT_SHT                      ((uint32_t)0x00000008U)         /* !< Comparator positive and negative
                                                                                    input terminals are shorted */
/* COMP_CTL1[IES] Bits */
#define COMP_CTL1_IES_OFS                        (4)                             /* !< IES Offset */
#define COMP_CTL1_IES_MASK                       ((uint32_t)0x00000010U)         /* !< This bit selected the interrupt
                                                                                    edge for COMPIFG and COMPINVIFG. */
#define COMP_CTL1_IES_RISING                     ((uint32_t)0x00000000U)         /* !< Rising edge sets COMPIFG and
                                                                                    falling edge sets COMPINVIFG */
#define COMP_CTL1_IES_FALLING                    ((uint32_t)0x00000010U)         /* !< Falling edge sets COMPIFG and
                                                                                    rising edge sets COMPINVIFG */
/* COMP_CTL1[HYST] Bits */
#define COMP_CTL1_HYST_OFS                       (5)                             /* !< HYST Offset */
#define COMP_CTL1_HYST_MASK                      ((uint32_t)0x00000060U)         /* !< These bits select the hysteresis
                                                                                    setting of the comparator. */
#define COMP_CTL1_HYST_NO_HYS                    ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define COMP_CTL1_HYST_LOW_HYS                   ((uint32_t)0x00000020U)         /* !< Low hysteresis, typical 10mV */
#define COMP_CTL1_HYST_MED_HYS                   ((uint32_t)0x00000040U)         /* !< Medium hysteresis, typical 20mV */
#define COMP_CTL1_HYST_HIGH_HYS                  ((uint32_t)0x00000060U)         /* !< High hysteresis, typical 30mV */
/* COMP_CTL1[OUTPOL] Bits */
#define COMP_CTL1_OUTPOL_OFS                     (7)                             /* !< OUTPOL Offset */
#define COMP_CTL1_OUTPOL_MASK                    ((uint32_t)0x00000080U)         /* !< This bit selects the comparator
                                                                                    output polarity. */
#define COMP_CTL1_OUTPOL_NON_INV                 ((uint32_t)0x00000000U)         /* !< Comparator output is non-inverted */
#define COMP_CTL1_OUTPOL_INV                     ((uint32_t)0x00000080U)         /* !< Comparator output is inverted */
/* COMP_CTL1[FLTEN] Bits */
#define COMP_CTL1_FLTEN_OFS                      (8)                             /* !< FLTEN Offset */
#define COMP_CTL1_FLTEN_MASK                     ((uint32_t)0x00000100U)         /* !< This bit enables the analog filter
                                                                                    at comparator output. */
#define COMP_CTL1_FLTEN_DISABLE                  ((uint32_t)0x00000000U)         /* !< Comparator output filter is
                                                                                    disabled */
#define COMP_CTL1_FLTEN_ENABLE                   ((uint32_t)0x00000100U)         /* !< Comparator output filter is enabled */
/* COMP_CTL1[FLTDLY] Bits */
#define COMP_CTL1_FLTDLY_OFS                     (9)                             /* !< FLTDLY Offset */
#define COMP_CTL1_FLTDLY_MASK                    ((uint32_t)0x00000600U)         /* !< These bits select the comparator
                                                                                    output filter delay. See the
                                                                                    device-specific data sheet for
                                                                                    specific values on comparator
                                                                                    propagation delay for different
                                                                                    filter delay settings. */
#define COMP_CTL1_FLTDLY_DLY_0                   ((uint32_t)0x00000000U)         /* !< Typical filter delay of 70 ns */
#define COMP_CTL1_FLTDLY_DLY_1                   ((uint32_t)0x00000200U)         /* !< Typical filter delay of 500 ns */
#define COMP_CTL1_FLTDLY_DLY_2                   ((uint32_t)0x00000400U)         /* !< Typical filter delay of 1200 ns */
#define COMP_CTL1_FLTDLY_DLY_3                   ((uint32_t)0x00000600U)         /* !< Typical filter delay of 2700 ns */
/* COMP_CTL1[DACOUTEN] Bits */
#define COMP_CTL1_DACOUTEN_OFS                   (11)                            /* !< DACOUTEN Offset */
#define COMP_CTL1_DACOUTEN_MASK                  ((uint32_t)0x00000800U)         /* !< This bit enables DAC8 output to be
                                                                                    connected to the pin. */
#define COMP_CTL1_DACOUTEN_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable the DAC8 output
                                                                                    connectivity to pin. */
#define COMP_CTL1_DACOUTEN_ENABLE                ((uint32_t)0x00000800U)         /* !< Enable the DAC8 output connectivity
                                                                                    to pin. */
/* COMP_CTL1[WINCOMPEN] Bits */
#define COMP_CTL1_WINCOMPEN_OFS                  (12)                            /* !< WINCOMPEN Offset */
#define COMP_CTL1_WINCOMPEN_MASK                 ((uint32_t)0x00001000U)         /* !< This bit enables window comparator
                                                                                    operation of comparator. */
#define COMP_CTL1_WINCOMPEN_OFF                  ((uint32_t)0x00000000U)         /* !< window comparator is disable */
#define COMP_CTL1_WINCOMPEN_ON                   ((uint32_t)0x00001000U)         /* !< window comparator is enable */

