TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_comp.h
/* COMP_CTL3 Bits */
/* COMP_CTL3[DACCODE0] Bits */
#define COMP_CTL3_DACCODE0_OFS                   (0)                             /* !< DACCODE0 Offset */
#define COMP_CTL3_DACCODE0_MASK                  ((uint32_t)0x000000FFU)         /* !< This is the first 8-bit DAC code.
                                                                                    When the DAC code is 0x0 the DAC
                                                                                    output will be selected reference
                                                                                    voltage x 1/256 V. When the DAC code
                                                                                    is 0xFF the DAC output will be
                                                                                    selected reference voltage x 255/256
                                                                                    V. */
#define COMP_CTL3_DACCODE0_MNIMUM                ((uint32_t)0x00000000U)         /* !< Minimum DAC code value */
#define COMP_CTL3_DACCODE0_MAXIMUM               ((uint32_t)0x000000FFU)         /* !< Minimum DAC code value */
/* COMP_CTL3[DACCODE1] Bits */
#define COMP_CTL3_DACCODE1_OFS                   (16)                            /* !< DACCODE1 Offset */
#define COMP_CTL3_DACCODE1_MASK                  ((uint32_t)0x00FF0000U)         /* !< This is the second 8-bit DAC code.
                                                                                    When the DAC code is 0x0 the DAC
                                                                                    output will be selected reference
                                                                                    voltage x 1/256 V. When the DAC code
                                                                                    is 0xFF the DAC output will be
                                                                                    selected reference voltage x 255/256
                                                                                    V. */
#define COMP_CTL3_DACCODE1_MNIMUM                ((uint32_t)0x00000000U)         /* !< Minimum DAC code value */
#define COMP_CTL3_DACCODE1_MAXIMUM               ((uint32_t)0x00FF0000U)         /* !< Minimum DAC code value */

/* COMP_STAT Bits */
/* COMP_STAT[OUT] Bits */
#define COMP_STAT_OUT_OFS                        (0)                             /* !< OUT Offset */
#define COMP_STAT_OUT_MASK                       ((uint32_t)0x00000001U)         /* !< This bit reflects the value of the
                                                                                    comparator output. Writing to this
                                                                                    bit has no effect on the comparator
                                                                                    output. */
#define COMP_STAT_OUT_LOW                        ((uint32_t)0x00000000U)         /* !< Comparator output is low */
#define COMP_STAT_OUT_HIGH                       ((uint32_t)0x00000001U)         /* !< Comparator output is high */

/* COMP_ANACMPWKUPCTL Bits */
/* COMP_ANACMPWKUPCTL[ANALOGCOMPARISONWAKEUPENABLEBIT] Bits */
#define COMP_ANACMPWKUPCTL_ANALOGCOMPARISONWAKEUPENABLEBIT_OFS (0)                             /* !< ANALOGCOMPARISONWAKEUPENABLEBIT
                                                                                    Offset */
#define COMP_ANACMPWKUPCTL_ANALOGCOMPARISONWAKEUPENABLEBIT_MASK ((uint32_t)0x00000001U)         /* !< 0: Analog comparison wakeup is
                                                                                    disabled (back ward compatible with
                                                                                    existing IP) 1 : Analog comparison
                                                                                    feature is enabled */

/* COMP_ANACMPCTRCTL Bits */
/* COMP_ANACMPCTRCTL[BLKCMPPRD] Bits */
#define COMP_ANACMPCTRCTL_BLKCMPPRD_OFS          (0)                             /* !< BLKCMPPRD Offset */
#define COMP_ANACMPCTRCTL_BLKCMPPRD_MASK         ((uint32_t)0x000000FFU)         /* !< Blanking and comparision period */
/* COMP_ANACMPCTRCTL[CMPPRD] Bits */
#define COMP_ANACMPCTRCTL_CMPPRD_OFS             (8)                             /* !< CMPPRD Offset */
#define COMP_ANACMPCTRCTL_CMPPRD_MASK            ((uint32_t)0x00000F00U)         /* !< Comparision period */

/* COMP_ANACMPDACCODE Bits */
/* COMP_ANACMPDACCODE[IP0DACCODE] Bits */
#define COMP_ANACMPDACCODE_IP0DACCODE_OFS        (0)                             /* !< IP0DACCODE Offset */
#define COMP_ANACMPDACCODE_IP0DACCODE_MASK       ((uint32_t)0x000000FFU)         /* !< Input0 daccode value */
/* COMP_ANACMPDACCODE[IP1DACCODE] Bits */
#define COMP_ANACMPDACCODE_IP1DACCODE_OFS        (8)                             /* !< IP1DACCODE Offset */
#define COMP_ANACMPDACCODE_IP1DACCODE_MASK       ((uint32_t)0x0000FF00U)         /* !< Input1 daccode value */
/* COMP_ANACMPDACCODE[IP2DACCODE] Bits */
#define COMP_ANACMPDACCODE_IP2DACCODE_OFS        (16)                            /* !< IP2DACCODE Offset */
#define COMP_ANACMPDACCODE_IP2DACCODE_MASK       ((uint32_t)0x00FF0000U)         /* !< Input2 daccode value */
/* COMP_ANACMPDACCODE[IP3DACCODE] Bits */
#define COMP_ANACMPDACCODE_IP3DACCODE_OFS        (24)                            /* !< IP3DACCODE Offset */
#define COMP_ANACMPDACCODE_IP3DACCODE_MASK       ((uint32_t)0xFF000000U)         /* !< Input3 daccode value */

/* COMP_ANACMPWD Bits */
/* COMP_ANACMPWD[WDEN] Bits */
#define COMP_ANACMPWD_WDEN_OFS                   (0)                             /* !< WDEN Offset */
#define COMP_ANACMPWD_WDEN_MASK                  ((uint32_t)0x00000001U)         /* !< 0 :  Window mode disable 1 :
                                                                                    Window mode enable */
/* COMP_ANACMPWD[INMUXSEL_WD] Bits */
#define COMP_ANACMPWD_INMUXSEL_WD_OFS            (1)                             /* !< INMUXSEL_WD Offset */
#define COMP_ANACMPWD_INMUXSEL_WD_MASK           ((uint32_t)0x00000006U)         /* !< Input mux (Static) selection for
                                                                                    window mode */

/* COMP_ANACMPCHSTS Bits */
/* COMP_ANACMPCHSTS[IN0EVT] Bits */
#define COMP_ANACMPCHSTS_IN0EVT_OFS              (0)                             /* !< IN0EVT Offset */
#define COMP_ANACMPCHSTS_IN0EVT_MASK             ((uint32_t)0x00000001U)         /* !< Input0 caused event */
/* COMP_ANACMPCHSTS[IN1EVT] Bits */
#define COMP_ANACMPCHSTS_IN1EVT_OFS              (1)                             /* !< IN1EVT Offset */
#define COMP_ANACMPCHSTS_IN1EVT_MASK             ((uint32_t)0x00000002U)         /* !< Input1 caused event */
/* COMP_ANACMPCHSTS[IN2EVT] Bits */
#define COMP_ANACMPCHSTS_IN2EVT_OFS              (2)                             /* !< IN2EVT Offset */
#define COMP_ANACMPCHSTS_IN2EVT_MASK             ((uint32_t)0x00000004U)         /* !< Input2 caused event */
/* COMP_ANACMPCHSTS[IN3EVT] Bits */
#define COMP_ANACMPCHSTS_IN3EVT_OFS              (3)                             /* !< IN3EVT Offset */
#define COMP_ANACMPCHSTS_IN3EVT_MASK             ((uint32_t)0x00000008U)         /* !< Input3 caused event */

/* COMP_ANACMPCHSTSCLR Bits */
/* COMP_ANACMPCHSTSCLR[IN0EVTCLR] Bits */
#define COMP_ANACMPCHSTSCLR_IN0EVTCLR_OFS        (0)                             /* !< IN0EVTCLR Offset */
#define COMP_ANACMPCHSTSCLR_IN0EVTCLR_MASK       ((uint32_t)0x00000001U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */
/* COMP_ANACMPCHSTSCLR[IN1EVTCLR] Bits */
#define COMP_ANACMPCHSTSCLR_IN1EVTCLR_OFS        (1)                             /* !< IN1EVTCLR Offset */
#define COMP_ANACMPCHSTSCLR_IN1EVTCLR_MASK       ((uint32_t)0x00000002U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */
/* COMP_ANACMPCHSTSCLR[IN2EVTCLR] Bits */
#define COMP_ANACMPCHSTSCLR_IN2EVTCLR_OFS        (2)                             /* !< IN2EVTCLR Offset */
#define COMP_ANACMPCHSTSCLR_IN2EVTCLR_MASK       ((uint32_t)0x00000004U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */
/* COMP_ANACMPCHSTSCLR[IN3EVTCLR] Bits */
#define COMP_ANACMPCHSTSCLR_IN3EVTCLR_OFS        (3)                             /* !< IN3EVTCLR Offset */
#define COMP_ANACMPCHSTSCLR_IN3EVTCLR_MASK       ((uint32_t)0x00000008U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_comp__include */

